examples/cylinder2D_openfoam/fluid-openfoam-orig/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    locations         faceCenters;
    patches           (cylinder_jet1);
    
    readData
    (
      Velocity
    );
    
    writeData
    (
      Pressure
    );
  };
};
